<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of DataRescue3, and extracts the pkg installer from the dmg.</string>
    <key>Identifier</key>
    <string>com.github.wbs75.download.DataRescue3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DataRescue3</string>
        <key>APPCAST_URL</key>
        <string>http://www.prosofteng.com/resources/dr3.1/dr3.1_appcast.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%APPCAST_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/%NAME%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
