<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Script Debugger disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.wbs75.munki.ScriptDebugger</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ScriptDebugger</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>devekopment</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>production</string>
            </array>
            <key>description</key>
            <string>Script Debugger provides everything you need to quickly and easily author AppleScripts that work. No other scripting tool can match Script Debugger's capabilities for creating, editing and debugging AppleScripts. Its sophisticated Dictionary browser provides far more information than any other tool can and eliminates guesswork and needless experimentation. Simply put, Script Debugger makes AppleScript easy.</string>
            <key>display_name</key>
            <string>Script Debugger</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.wbs75.download.ScriptDebugger</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>

