<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest TechTool Pro 7 disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.wbs75.munki.TechToolPro-7</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TechToolPro-7</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>utilities</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>TechTool Pro is now 7, and this is the most advanced version of the acclaimed Macintosh troubleshooting utility created in its 20-year history. Micromat has redeveloped TechTool Pro 7 to be fully 64-bit compatible, which allows the program to run more efficiently on the latest Macintosh computers. We also added a fantastic new RAM test that can find problems which no other utility can; and we also improved many of the testing, repair, and maintenance routines. </string>
            <key>display_name</key>
            <string>TechTool Pro 7</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.wbs75.download.TechToolPro-7</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
