<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>MunkiAdmin, GUI importer for Munki.</string>
    <key>Identifier</key>
    <string>com.github.wbs75.autopkg-recipes</string>
    <key>Input</key>
    <dict>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiAdminURLProvider</string>
        </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
            </dict>
        <dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
            <dict>
                <key>MUNKI_REPO_SUBDIR</key>
                <string>automation/munki</string>
                <key>NAME</key>
                <string>MunkiAdmin</string>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
    </array>
</dict>
</plist>
