<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Air Display Host disk image.</string>
    <key>Identifier</key>
    <string>com.github.wbs75.download.airdisplay-host</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>airdisplay-host</string>
        <key>SPARKLE_FEED_URL</key>
        <string>http://www.avatron.com</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>http://www.avatron.com/updates/software/airdisplay/appcast.xml</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http.*?macosx-x86_64.zip)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
